PREFIX bd: <http://www.bigdata.com/rdf#>
PREFIX cc: <http://creativecommons.org/ns#>
PREFIX dct: <http://purl.org/dc/terms/>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX p: <http://www.wikidata.org/prop/>
PREFIX pq: <http://www.wikidata.org/prop/qualifier/>
PREFIX pqn: <http://www.wikidata.org/prop/qualifier/value-normalized/>
PREFIX pqv: <http://www.wikidata.org/prop/qualifier/value/>
PREFIX pr: <http://www.wikidata.org/prop/reference/>
PREFIX prn: <http://www.wikidata.org/prop/reference/value-normalized/>
PREFIX prov: <http://www.w3.org/ns/prov#>
PREFIX prv: <http://www.wikidata.org/prop/reference/value/>
PREFIX ps: <http://www.wikidata.org/prop/statement/>
PREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>
PREFIX psv: <http://www.wikidata.org/prop/statement/value/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX schema: <http://schema.org/>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX wd: <http://www.wikidata.org/entity/>
PREFIX wdata: <http://www.wikidata.org/wiki/Special:EntityData/>
PREFIX wdno: <http://www.wikidata.org/prop/novalue/>
PREFIX wdref: <http://www.wikidata.org/reference/>
PREFIX wds: <http://www.wikidata.org/entity/statement/>
PREFIX wdt: <http://www.wikidata.org/prop/direct/>
PREFIX wdtn: <http://www.wikidata.org/prop/direct-normalized/>
PREFIX wdv: <http://www.wikidata.org/value/>
PREFIX wikibase: <http://wikiba.se/ontology#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
#defaultView:LineChart
SELECT
  (?year_of_citation AS ?year)
  (?number_of_citations/?number_of_works AS ?citations_to_works_ratio)
  ?number_of_works
  ?number_of_citations
  ?organization ?organizationLabel  
WHERE {
  # Join the work and citation counts
  {
  # Count the number of citations received per year per organization
  SELECT 
    ?year_of_citation (COUNT(?work) AS ?number_of_citations) ?organization
  WHERE {
    {
  # Find works associated with the organizations
  SELECT
    # Should not count authors twice
    DISTINCT ?work ?organization
  WHERE {
    {
  # Bind organizations to variable
  SELECT ?organization WHERE {
    VALUES ?organization { {% for q in qs %} wd:{{ q }} {% endfor %} }
  }
}   ?author wdt:P108 | wdt:P463 | (wdt:P1416/wdt:P361*) ?organization . 
    ?work wdt:P50 ?author .
  }
}   ?citing_work wdt:P2860 ?work . 
    ?citing_work wdt:P577 ?citing_publication_date .
    BIND(STR(YEAR(?citing_publication_date)) AS ?year_of_citation)
  }
  GROUP BY ?year_of_citation ?organization
} {
  # Count the number of works published per year per organization
  SELECT
    ?year_of_cited (COUNT(?work) AS ?number_of_works) ?organization
  WHERE {
    {
  # Find works associated with the organizations
  SELECT
    # Should not count authors twice
    DISTINCT ?work ?organization
  WHERE {
    {
  # Bind organizations to variable
  SELECT ?organization WHERE {
    VALUES ?organization { {% for q in qs %} wd:{{ q }} {% endfor %} }
  }
}   ?author wdt:P108 | wdt:P463 | (wdt:P1416/wdt:P361*) ?organization . 
    ?work wdt:P50 ?author .
  }
}   ?work wdt:P577 ?cited_publication_date .
    BIND(STR(YEAR(?cited_publication_date)) AS ?year_of_cited)
  } 
  GROUP BY ?year_of_cited ?organization
} FILTER (?year_of_citation = ?year_of_cited)
  OPTIONAL { ?organization rdfs:label ?organizationLabel .  FILTER ( lang(?organizationLabel) = 'en' ) }
}
ORDER BY ?year_of_citation
 
